In [ ]:
# import pyspark in google colab
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.10/dist-packages (3.5.2)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)

# Call library

In [ ]:
import pyspark
from pyspark import SparkContext
from pyspark.sql import SparkSession, DataFrame
import pyspark.sql.functions as f
from pyspark.sql.window import Window
from pyspark.sql import *

# create Sparksession

In [ ]:
spark = SparkSession.builder.appName('Gautam').getOrCreate()

#call spark session

In [ ]:
spark

# Enter data

In [ ]:
data =[
    (1, "Alice", "HR", 70000),
    (2, "Bob", "HR", 80000),
    (3, "Charlie", "IT", 90000),
    (4, "David", "IT", 95000),
    (5, "Eve", "Finance", 100000),
    (6, "Frank", "Finance", 95000),
    (7, "Grace", "HR", 75000),
    (8, "Hannah", "HR", 82000),
    (9, "Ivy", "IT", 87000),
    (10, "Jack", "IT", 93000),
    (11, "Karen", "IT", 97000),
    (12, "Leo", "Finance", 98000),
    (13, "Mia", "Finance", 105000),
    (14, "Nina", "Sales", 110000),
    (15, "Oscar", "Sales", 95000),
    (16, "Paul", "Marketing", 90000),
    (17, "Quinn", "Marketing", 92000),
    (18, "Rita", "Marketing", 88000),
    (19, "Steve", "Sales", 99000),
    (20, "Tina", "Engineering", 115000),
    (21, "Uma", "Engineering", 110000),
    (22, "Vera", "Engineering", 108000)
]

columns = ["Id","Name","Department","Salary"]

# show data

In [ ]:
data

[(1, 'Alice', 'HR', 70000),
 (2, 'Bob', 'HR', 80000),
 (3, 'Charlie', 'IT', 90000),
 (4, 'David', 'IT', 95000),
 (5, 'Eve', 'Finance', 100000),
 (6, 'Frank', 'Finance', 95000),
 (7, 'Grace', 'HR', 75000),
 (8, 'Hannah', 'HR', 82000),
 (9, 'Ivy', 'IT', 87000),
 (10, 'Jack', 'IT', 93000),
 (11, 'Karen', 'IT', 97000),
 (12, 'Leo', 'Finance', 98000),
 (13, 'Mia', 'Finance', 105000),
 (14, 'Nina', 'Sales', 110000),
 (15, 'Oscar', 'Sales', 95000),
 (16, 'Paul', 'Marketing', 90000),
 (17, 'Quinn', 'Marketing', 92000),
 (18, 'Rita', 'Marketing', 88000),
 (19, 'Steve', 'Sales', 99000),
 (20, 'Tina', 'Engineering', 115000),
 (21, 'Uma', 'Engineering', 110000),
 (22, 'Vera', 'Engineering', 108000)]

# convert list data into DataFrame

In [ ]:
df = spark.createDataFrame(data,columns)

# Retrives records in **dataframe**

In [ ]:
df.show()

+---+-------+-----------+------+
| Id|   Name| Department|Salary|
+---+-------+-----------+------+
|  1|  Alice|         HR| 70000|
|  2|    Bob|         HR| 80000|
|  3|Charlie|         IT| 90000|
|  4|  David|         IT| 95000|
|  5|    Eve|    Finance|100000|
|  6|  Frank|    Finance| 95000|
|  7|  Grace|         HR| 75000|
|  8| Hannah|         HR| 82000|
|  9|    Ivy|         IT| 87000|
| 10|   Jack|         IT| 93000|
| 11|  Karen|         IT| 97000|
| 12|    Leo|    Finance| 98000|
| 13|    Mia|    Finance|105000|
| 14|   Nina|      Sales|110000|
| 15|  Oscar|      Sales| 95000|
| 16|   Paul|  Marketing| 90000|
| 17|  Quinn|  Marketing| 92000|
| 18|   Rita|  Marketing| 88000|
| 19|  Steve|      Sales| 99000|
| 20|   Tina|Engineering|115000|
+---+-------+-----------+------+
only showing top 20 rows

# Retrives all records in **dataframe**

In [ ]:
df.show(df.count())

+---+-------+-----------+------+
| Id|   Name| Department|Salary|
+---+-------+-----------+------+
|  1|  Alice|         HR| 70000|
|  2|    Bob|         HR| 80000|
|  3|Charlie|         IT| 90000|
|  4|  David|         IT| 95000|
|  5|    Eve|    Finance|100000|
|  6|  Frank|    Finance| 95000|
|  7|  Grace|         HR| 75000|
|  8| Hannah|         HR| 82000|
|  9|    Ivy|         IT| 87000|
| 10|   Jack|         IT| 93000|
| 11|  Karen|         IT| 97000|
| 12|    Leo|    Finance| 98000|
| 13|    Mia|    Finance|105000|
| 14|   Nina|      Sales|110000|
| 15|  Oscar|      Sales| 95000|
| 16|   Paul|  Marketing| 90000|
| 17|  Quinn|  Marketing| 92000|
| 18|   Rita|  Marketing| 88000|
| 19|  Steve|      Sales| 99000|
| 20|   Tina|Engineering|115000|
| 21|    Uma|Engineering|110000|
| 22|   Vera|Engineering|108000|
+---+-------+-----------+------+

# Create New Data to Append

In [ ]:
data2 = [
    (23, "Walter", "HR", 77000),
    (24, "Xena", "HR", 85000),
    (25, "Yara", "IT", 96000),
    (26, "Zack", "IT", 94000),
    (27, "Alice", "Finance", 102000),
    (28, "Bob", "Finance", 99000),
    (29, "Chris", "Sales", 105000),
    (30, "Diana", "Sales", 98000),
    (31, "Eric", "Marketing", 93000),
    (32, "Fiona", "Marketing", 91000),
    (33, "George", "Engineering", 112000),
    (34, "Holly", "Engineering", 109000),
    (35, "Ian", "Engineering", 106000),
    (36, "Judy", "Operations", 85000),
    (37, "Kyle", "Operations", 87000),
    (38, "Laura", "Operations", 88000),
    (39, "Mason", "Legal", 95000),
    (40, "Nina", "Legal", 92000),
    (41, "Owen", "Legal", 97000),
    (42, "Pam", "Customer Support", 78000),
    (43, "Quincy", "Customer Support", 80000),
    (44, "Riley", "Customer Support", 79000),
    (45, "Sophie", "Research", 90000),
    (46, "Tim", "Research", 88000),
    (47, "Uma", "Research", 91000),
    (48, "Vince", "Design", 94000),
    (49, "Wendy", "Design", 96000),
    (50, "Xander", "Design", 95000)

]

In [ ]:
df2 = spark.createDataFrame(data2,columns)

In [ ]:
df2.show()

+---+------+----------------+------+
| Id|  Name|      Department|Salary|
+---+------+----------------+------+
| 23|Walter|              HR| 77000|
| 24|  Xena|              HR| 85000|
| 25|  Yara|              IT| 96000|
| 26|  Zack|              IT| 94000|
| 27| Alice|         Finance|102000|
| 28|   Bob|         Finance| 99000|
| 29| Chris|           Sales|105000|
| 30| Diana|           Sales| 98000|
| 31|  Eric|       Marketing| 93000|
| 32| Fiona|       Marketing| 91000|
| 33|George|     Engineering|112000|
| 34| Holly|     Engineering|109000|
| 35|   Ian|     Engineering|106000|
| 36|  Judy|      Operations| 85000|
| 37|  Kyle|      Operations| 87000|
| 38| Laura|      Operations| 88000|
| 39| Mason|           Legal| 95000|
| 40|  Nina|           Legal| 92000|
| 41|  Owen|           Legal| 97000|
| 42|   Pam|Customer Support| 78000|
+---+------+----------------+------+
only showing top 20 rows

# Append data and create new dataframe

In [ ]:
union_data = df.unionAll(df2)

# Retrive combine dataframe (Union_data)

In [ ]:
union_data.show(union_data.count())

+---+-------+----------------+------+
| Id|   Name|      Department|Salary|
+---+-------+----------------+------+
|  1|  Alice|              HR| 70000|
|  2|    Bob|              HR| 80000|
|  3|Charlie|              IT| 90000|
|  4|  David|              IT| 95000|
|  5|    Eve|         Finance|100000|
|  6|  Frank|         Finance| 95000|
|  7|  Grace|              HR| 75000|
|  8| Hannah|              HR| 82000|
|  9|    Ivy|              IT| 87000|
| 10|   Jack|              IT| 93000|
| 11|  Karen|              IT| 97000|
| 12|    Leo|         Finance| 98000|
| 13|    Mia|         Finance|105000|
| 14|   Nina|           Sales|110000|
| 15|  Oscar|           Sales| 95000|
| 16|   Paul|       Marketing| 90000|
| 17|  Quinn|       Marketing| 92000|
| 18|   Rita|       Marketing| 88000|
| 19|  Steve|           Sales| 99000|
| 20|   Tina|     Engineering|115000|
| 21|    Uma|     Engineering|110000|
| 22|   Vera|     Engineering|108000|
| 23| Walter|              HR| 77000|
| 24|   Xena|              HR| 85000|
| 25|   Yara|              IT| 96000|
| 26|   Zack|              IT| 94000|
| 27|  Alice|         Finance|102000|
| 28|    Bob|         Finance| 99000|
| 29|  Chris|           Sales|105000|
| 30|  Diana|           Sales| 98000|
| 31|   Eric|       Marketing| 93000|
| 32|  Fiona|       Marketing| 91000|
| 33| George|     Engineering|112000|
| 34|  Holly|     Engineering|109000|
| 35|    Ian|     Engineering|106000|
| 36|   Judy|      Operations| 85000|
| 37|   Kyle|      Operations| 87000|
| 38|  Laura|      Operations| 88000|
| 39|  Mason|           Legal| 95000|
| 40|   Nina|           Legal| 92000|
| 41|   Owen|           Legal| 97000|
| 42|    Pam|Customer Support| 78000|
| 43| Quincy|Customer Support| 80000|
| 44|  Riley|Customer Support| 79000|
| 45| Sophie|        Research| 90000|
| 46|    Tim|        Research| 88000|
| 47|    Uma|        Research| 91000|
| 48|  Vince|          Design| 94000|
| 49|  Wendy|          Design| 96000|
| 50| Xander|          Design| 95000|
+---+-------+----------------+------+

# Number of records

In [ ]:
count_row = union_data.count()
print(count_row)

50

# duplicate check

In [ ]:
No_of_duplicate = union_data.dropDuplicates()

In [ ]:
number_duplicate = No_of_duplicate.count()
print(f'Row before Remove Duplicate {count_row}')
print(f'After drop duplicate {number_duplicate}')

Row before Remove Duplicate 50
After drop duplicate 50

# Check number of Department

In [ ]:
count_dep = union_data.select("Department").distinct().count()
print(count_dep)

11

# List of Dept

In [ ]:
count_dep = union_data.select("Department").distinct()
count_dep.show()

+----------------+
|      Department|
+----------------+
|              HR|
|         Finance|
|              IT|
|           Sales|
|     Engineering|
|       Marketing|
|      Operations|
|Customer Support|
|        Research|
|           Legal|
|          Design|
+----------------+

# Each Department wise emp

In [ ]:
no_of_department = union_data.groupBy('Department').count()

In [ ]:
no_of_department.show()

+----------------+-----+
|      Department|count|
+----------------+-----+
|              HR|    6|
|         Finance|    6|
|              IT|    7|
|           Sales|    5|
|     Engineering|    6|
|       Marketing|    5|
|      Operations|    3|
|Customer Support|    3|
|        Research|    3|
|           Legal|    3|
|          Design|    3|
+----------------+-----+

# Apply window funcation in 'Department' and 'Salary' columns

In [ ]:
windows = Window.partitionBy('Department').orderBy(f.desc('Salary'))

# Apply rank in dataframe

In [ ]:
df_rnk = union_data.withColumn('Rank',f.dense_rank().over(windows))

# Retrive data with additional rank columns

In [ ]:
df_rnk.show(df_rnk.count())

+---+-------+----------------+------+----+
| Id|   Name|      Department|Salary|Rank|
+---+-------+----------------+------+----+
| 43| Quincy|Customer Support| 80000|   1|
| 44|  Riley|Customer Support| 79000|   2|
| 42|    Pam|Customer Support| 78000|   3|
| 49|  Wendy|          Design| 96000|   1|
| 50| Xander|          Design| 95000|   2|
| 48|  Vince|          Design| 94000|   3|
| 20|   Tina|     Engineering|115000|   1|
| 33| George|     Engineering|112000|   2|
| 21|    Uma|     Engineering|110000|   3|
| 34|  Holly|     Engineering|109000|   4|
| 22|   Vera|     Engineering|108000|   5|
| 35|    Ian|     Engineering|106000|   6|
| 13|    Mia|         Finance|105000|   1|
| 27|  Alice|         Finance|102000|   2|
|  5|    Eve|         Finance|100000|   3|
| 28|    Bob|         Finance| 99000|   4|
| 12|    Leo|         Finance| 98000|   5|
|  6|  Frank|         Finance| 95000|   6|
| 24|   Xena|              HR| 85000|   1|
|  8| Hannah|              HR| 82000|   2|
|  2|    Bob|              HR| 80000|   3|
| 23| Walter|              HR| 77000|   4|
|  7|  Grace|              HR| 75000|   5|
|  1|  Alice|              HR| 70000|   6|
| 11|  Karen|              IT| 97000|   1|
| 25|   Yara|              IT| 96000|   2|
|  4|  David|              IT| 95000|   3|
| 26|   Zack|              IT| 94000|   4|
| 10|   Jack|              IT| 93000|   5|
|  3|Charlie|              IT| 90000|   6|
|  9|    Ivy|              IT| 87000|   7|
| 41|   Owen|           Legal| 97000|   1|
| 39|  Mason|           Legal| 95000|   2|
| 40|   Nina|           Legal| 92000|   3|
| 31|   Eric|       Marketing| 93000|   1|
| 17|  Quinn|       Marketing| 92000|   2|
| 32|  Fiona|       Marketing| 91000|   3|
| 16|   Paul|       Marketing| 90000|   4|
| 18|   Rita|       Marketing| 88000|   5|
| 38|  Laura|      Operations| 88000|   1|
| 37|   Kyle|      Operations| 87000|   2|
| 36|   Judy|      Operations| 85000|   3|
| 47|    Uma|        Research| 91000|   1|
| 45| Sophie|        Research| 90000|   2|
| 46|    Tim|        Research| 88000|   3|
| 14|   Nina|           Sales|110000|   1|
| 29|  Chris|           Sales|105000|   2|
| 19|  Steve|           Sales| 99000|   3|
| 30|  Diana|           Sales| 98000|   4|
| 15|  Oscar|           Sales| 95000|   5|
+---+-------+----------------+------+----+

# Retrive rank 1 data with id, name, department, sal or rank

In [ ]:
rank1=df_rnk.filter(f.col("Rank")==1)
rank1.show()
without_rank_columns = rank1.drop("Rank").show()

+---+------+----------------+------+----+
| Id|  Name|      Department|Salary|Rank|
+---+------+----------------+------+----+
| 43|Quincy|Customer Support| 80000|   1|
| 49| Wendy|          Design| 96000|   1|
| 20|  Tina|     Engineering|115000|   1|
| 13|   Mia|         Finance|105000|   1|
| 24|  Xena|              HR| 85000|   1|
| 11| Karen|              IT| 97000|   1|
| 41|  Owen|           Legal| 97000|   1|
| 31|  Eric|       Marketing| 93000|   1|
| 38| Laura|      Operations| 88000|   1|
| 47|   Uma|        Research| 91000|   1|
| 14|  Nina|           Sales|110000|   1|
+---+------+----------------+------+----+

+---+------+----------------+------+
| Id|  Name|      Department|Salary|
+---+------+----------------+------+
| 43|Quincy|Customer Support| 80000|
| 49| Wendy|          Design| 96000|
| 20|  Tina|     Engineering|115000|
| 13|   Mia|         Finance|105000|
| 24|  Xena|              HR| 85000|
| 11| Karen|              IT| 97000|
| 41|  Owen|           Legal| 97000|
| 31|  Eric|       Marketing| 93000|
| 38| Laura|      Operations| 88000|
| 47|   Uma|        Research| 91000|
| 14|  Nina|           Sales|110000|
+---+------+----------------+------+

# Retrive rank 4 data with id, name, department, sal or rank

In [ ]:
rank4=df_rnk.filter(f.col("Rank")==4)
rank4.show()
without_rank_columns = rank4.drop("Rank").show()

+---+------+-----------+------+----+
| Id|  Name| Department|Salary|Rank|
+---+------+-----------+------+----+
| 34| Holly|Engineering|109000|   4|
| 28|   Bob|    Finance| 99000|   4|
| 23|Walter|         HR| 77000|   4|
| 26|  Zack|         IT| 94000|   4|
| 16|  Paul|  Marketing| 90000|   4|
| 30| Diana|      Sales| 98000|   4|
+---+------+-----------+------+----+

+---+------+-----------+------+
| Id|  Name| Department|Salary|
+---+------+-----------+------+
| 34| Holly|Engineering|109000|
| 28|   Bob|    Finance| 99000|
| 23|Walter|         HR| 77000|
| 26|  Zack|         IT| 94000|
| 16|  Paul|  Marketing| 90000|
| 30| Diana|      Sales| 98000|
+---+------+-----------+------+

# Thank you